RET = {
    OK: "0",
    DBERR: "4001",
    NODATA: "4002",
    DATAEXIST: "4003",
    DATAERR: "4004",
    SESSIONERR: "4101",
    LOGINERR: "4102",
    PARAMERR: "4103",
    USERERR: "4104",
    ROLEERR: "4105",
    PWDERR: "4106",
    REQERR: "4201",
    IPERR: "4202",
    THIRDERR: "4301",
    IOERR: "4302",
    SERVERERR: "4500",
    UNKOWNERR: "4501"
}

ret_map = {
    "0": "成功",
    "4001": "数据库查询错误",
    "4002": "无数据",
    "4003": "数据已存在",
    "4004": "数据错误",
    "4101": "用户未登录",
    "4102": "用户登录失败",
    "4103": "参数错误",
    "4104": "用户不存在或未激活",
    "4105": "用户身份错误",
    "4106": "密码错误",
    "4201": "非法请求或请求次数受限",
    "4202": "IP受限",
    "4301": "第三方系统错误",
    "4302": "文件读写错误",
    "4500": "内部错误",
    "4501": "未知错误",
}

TOKEN=md5('ihome_bj14')
